package cn.common.tools.utils

import scala.collection.mutable

object Constant {
  val luomaNumMap = mutable.Map(
    "Ⅰ" -> "1",
    "Ⅱ" -> "2",
    "II" -> "2",
    "Ⅲ" -> "3",
    "Ⅳ" -> "4",
    "Ⅴ" -> "5",
    "Ⅵ" -> "6",
    "Ⅶ" -> "7",
    "Ⅷ" -> "8",
    "Ⅸ" -> "9",
    "Ⅹ" -> "10",
    "Ⅺ" -> "11",
    "Ⅻ" -> "12"
  )
  //"XIII","XIV","XV","XVI","XVII","XVIII","XIX","XX"

  val zhNumMap = mutable.Map(
    "第一季" -> "1",
    "第二季" -> "2",
    "第三季" -> "3",
    "第四季" -> "4",
    "第五季" -> "5",
    "第六季" -> "6",
    "第七季" -> "7",
    "第八季" -> "8",
    "第九季" -> "9",
    "第十季" -> "10",
    "第十一季" -> "11",
    "第十三季" -> "12",
    "第十四季" -> "12",
    "第十五季" -> "12",
    "第十六季" -> "12",
    "第十七季" -> "12",
    "第十八季" -> "12",
    "第十九季" -> "12",
    "第二十季" -> "12",
    "第二十一季" -> "12",
    "第二十二季" -> "22",
    "第二十三季" -> "23",
    "第二十四季" -> "24",
    "第二十五季" -> "25",
    "第二十六季" -> "26",
    "第一部" -> "1",
    "第二部" -> "2",
    "第三部" -> "3",
    "第四部" -> "4",
    "第五部" -> "5",
    "第六部" -> "6",
    "第七部" -> "7",
    "第八部" -> "8",
    "第九部" -> "9",
    "第十部" -> "10",
    "第十一部" -> "11",
    "第十三部" -> "12",
    "第十四部" -> "12",
    "第十五部" -> "12",
    "第十六部" -> "12",
    "第十七部" -> "12",
    "第十八部" -> "12",
    "第十九部" -> "12",
    "第二十部" -> "12",
    "第二十一部" -> "12",
    "第二十二部" -> "22",
    "第二十三部" -> "23",
    "第二十四部" -> "24",
    "第二十五部" -> "25",
    "第二十六部" -> "26"
  )


  val versionArr = Array[String](
    "未删减版", "[未删减版]", "完整版", "全集", "完全版", "[TV版]", "TV版", "tv版", "精华版", "（国语）", "（国语版）", "[国语版]",
    "国语", "国语版", "国语中字", "（英语版）", "英语中字", "（英语）", "[英语版]", "英语版", "[英语]", "粤语版", "粤语", "（粤语版）",
    "（粤语）", "[粤语版]", "[粤语]", "日语版", "（日语版）", "日语", "中文版", "TV中文版", "（中文版）", "韩语版", "[韩语版]", "韩语中字",
    "四川话版", "云南话版", "东北话版", "天津话版", "兰州话版", "潮汕话版", "陕西话版", "闽南语版", "上海话版", "日配版", "法语版", "卫视版",
    "央视版", "TVB版", "浙江卫视版", "湖南卫视版", "东方卫视版", "安徽卫视版", "深圳卫视版", "旅游卫视版", "江西卫视版", "[DVD版]","DVD版",
    "网络版", "电视版", "版权版", "OVA", "标准版", "原版", "未删剪原版", "4K版", "（4K）", "VR版", "（VR）", "1080P", "1080p", "3D版",
    "【3D版】", "（新3D版）", "（3D）", "3D", "标清版", "_标清", "蓝光真高清", "（蓝光真高清）", "（清晰版）", "高清版", "高清字幕版",
    "【高清】", "[高清版]", "春节贺岁版", "纯享版", "精简版", "加长版", "（加长版）", "（加长重映版）", "精编版", "重制版", "字幕版",
    "双语字幕版", "（双语字幕版）", "高清无字幕版", "完整字幕版", "中英字幕版", "免费版", "（免费版）", "[免费版]", "（原声）", "原声",
    "原声高清版", "英文原声高清版", "特别版", "生肖特别版", "圣诞特别版", "美版", "（美版）", "DVD版", "dvd版", "-TV版", "（四川版）",
    "(环绕声版)", "独家精华版", "日文版", "周播版", "（北美版）", "（东北版）", "英文版", "(英文版)", "潮汕版", "精编版纪念版", "合集版",
    "经典版", "精简版", "纯享版", "定制版", "混剪版", "贺岁版", "春节贺岁版", "周末版", "周间版", "日播版", "典藏版", "教学版", "独家未播版",
    "VR", "特别版", "重制版", "国际版", "独家抢鲜版", "影院版", "免费版", "短剧版", "搜狐版", "幕版", "特效重制版", "终极版", "明星版",
    "配音版", "重映版", "晚间版", "新编集版", "标准版", "原声版", "（午间版）", "数字集版","精编"
  )

  val partWord = Array[String](
    "数字集版", "第.*集", "\\s*第.*集", "-第.*集", "(第.*集)", "_\\d*", "大结局", "先导集", "先导集上", "先导集下", "上集", "下集", "第.*期", "空格第.*期", "-第.*期", "(第.*期)", "上部","下部"
  )

  val filmArr = Array[String](
    "戏曲电影","豫剧电影","电影","周末影院","中国","台湾","经典影院","电影频道出品","影视留声机","香港","活力影院","电视剧","周剧","动画片","第一动画乐园",
    "动画大放映周末下午版","动画大放映下午版","动画大放映上午版","动画大放映周末早间版","动画大放映周末",
    "动画梦工场","动画大放映早间版","动画乐翻天","动画狂欢曲引进版","动画狂欢曲","优秀儿童剧日常版","动画大放映引进版","周播剧",
    "邦锦梅朵动画乐园","动画梦工场","纪录片","不夜场","东南剧苑","青春进行时","午间剧场","红石榴剧场","黄金剧场","凌晨剧场","天山剧场",
    "动画大放映"
  )

}
